# Pandas

Importación usual de Pandas.

In [74]:
import numpy as np
import pandas as pd
pd.__version__

'1.3.3'

# Creación de objetos
`pandas.Series` son arreglos de una dimensión ndarray con etiquetas de ejes (incluyendo series de tiempo). 

Un ndarray es un contenedor multidimensional de elementos del mismo tipo y tamaño, el cual se define por su forma que es una tupla de n enteros positivos que especifican los tamaños de cada dimensión.

Creación de serie con índice default:

In [75]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [76]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

`pandas.DataFrame` es una estructura de dos dimensiones, mutable respecto al tamaño , con datos tabulares potencialmente heterogéneos.

En este caso el índice es de tipo `datetime` y las columnas se encuentran etiquetadas.

In [146]:
df = pd.DataFrame(np.random.randn(6,5), index=dates, columns=list("ABDCX"))
df

                   A         B         D         C         X
2013-01-01 -1.376087  0.502918  0.356499 -0.311570 -1.737691
2013-01-02  0.085106 -1.324656  0.231017  0.341693  1.377019
2013-01-03 -0.452804 -0.944107 -0.509232  0.377383  1.557824
2013-01-04 -0.586525  0.224899  1.468149  0.989342  0.447174
2013-01-05  1.574519 -0.838972  0.527583 -0.232958  0.096228
2013-01-06  1.026690  1.149348  0.930242 -0.925314  1.164208

In [78]:
np.random.randn(6,4)

array([[ 0.26725974,  0.82975762, -1.57828061,  0.93029044],
       [ 0.16112557, -0.30062536, -0.71409904,  0.47583978],
       [-2.15647387,  0.69517825, -1.66180845,  2.35457924],
       [ 0.36605992,  0.68369518,  0.42789856, -0.23952078],
       [ 0.50354693,  0.14918564, -0.98773001,  0.48438588],
       [ 1.20256326,  0.86542773,  0.1338839 ,  1.14077654]])

Es posible pasar objetos de tipo diccionario los cuales se convierten a series.

In [79]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)),dtype="float32"),
        "D": np.array([3]*4,dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo"
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

Las columnas tienen distintos tipos.

In [80]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

# Visualizar datos
`head` y `tail`

In [81]:
df.head()

                   A         B         D         C         X
2013-01-01 -0.239981 -0.720872 -0.384446  2.096242 -0.635704
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197
2013-01-04 -0.308344  2.326122  1.540251 -0.969621  1.101655
2013-01-05 -0.561865 -0.912876  0.252763  0.271427  1.259736

In [82]:
df.tail(4)

                   A         B         D         C         X
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197
2013-01-04 -0.308344  2.326122  1.540251 -0.969621  1.101655
2013-01-05 -0.561865 -0.912876  0.252763  0.271427  1.259736
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716

Consultar el índice y las columnas.

In [83]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [84]:
df.columns

Index(['A', 'B', 'D', 'C', 'X'], dtype='object')

Los elementos de los arreglos en NumPy tienen el mismo tipo. Los DataFrames de pandas tienen un tipo por columna.

Todos los valores de `df` son float, por lo que la conversión es rápida.

In [85]:
df.to_numpy()

array([[-0.23998079, -0.72087152, -0.38444607,  2.09624184, -0.6357044 ],
       [-0.42764981, -1.77171629, -1.59780531,  1.26722179,  1.43590983],
       [ 0.03733708,  0.78735926,  0.97619199,  0.10481807,  0.73019722],
       [-0.30834405,  2.32612151,  1.54025084, -0.96962138,  1.10165547],
       [-0.56186489, -0.91287641,  0.25276343,  0.27142669,  1.25973646],
       [ 0.0277061 ,  0.11013028, -0.33738599,  1.03766998,  0.46671603]])

La conversión a numpy es cara con dataframes con múltiples tipos (dtype).

In [86]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

Estadísticas generales por medio de `describe()`

In [87]:
df.describe()

              A         B         D         C         X
count  6.000000  6.000000  6.000000  6.000000  6.000000
mean  -0.245466 -0.030309  0.074928  0.634626  0.726418
std    0.241613  1.451163  1.110868  1.066317  0.755175
min   -0.561865 -1.771716 -1.597805 -0.969621 -0.635704
25%   -0.397823 -0.864875 -0.372681  0.146470  0.532586
50%   -0.274162 -0.305371 -0.042311  0.654548  0.915926
75%   -0.039216  0.618052  0.795335  1.209834  1.220216
max    0.037337  2.326122  1.540251  2.096242  1.435910

Transposición de datos

In [88]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.239981   -0.427650    0.037337   -0.308344   -0.561865    0.027706
B   -0.720872   -1.771716    0.787359    2.326122   -0.912876    0.110130
D   -0.384446   -1.597805    0.976192    1.540251    0.252763   -0.337386
C    2.096242    1.267222    0.104818   -0.969621    0.271427    1.037670
X   -0.635704    1.435910    0.730197    1.101655    1.259736    0.466716

Ordenar por índice

In [89]:
df.sort_index(axis=1, ascending=False)

                   X         D         C         B         A
2013-01-01 -0.635704 -0.384446  2.096242 -0.720872 -0.239981
2013-01-02  1.435910 -1.597805  1.267222 -1.771716 -0.427650
2013-01-03  0.730197  0.976192  0.104818  0.787359  0.037337
2013-01-04  1.101655  1.540251 -0.969621  2.326122 -0.308344
2013-01-05  1.259736  0.252763  0.271427 -0.912876 -0.561865
2013-01-06  0.466716 -0.337386  1.037670  0.110130  0.027706

Ordenar por eje

In [90]:
df.sort_values(by="X", ascending=False)

                   A         B         D         C         X
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910
2013-01-05 -0.561865 -0.912876  0.252763  0.271427  1.259736
2013-01-04 -0.308344  2.326122  1.540251 -0.969621  1.101655
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716
2013-01-01 -0.239981 -0.720872 -0.384446  2.096242 -0.635704

# Selección
Las expresiones estándar son intuitivas y adecuadas para escenarios interactivos. Para aplicaciones de producción se recomiendan `at`, `.iat`, `.loc` y `.iloc`

# Obtener datos

Una sola columna

In [91]:
df.D

2013-01-01   -0.384446
2013-01-02   -1.597805
2013-01-03    0.976192
2013-01-04    1.540251
2013-01-05    0.252763
2013-01-06   -0.337386
Freq: D, Name: D, dtype: float64

Slicing de renglones

In [92]:
df[0:2]

                   A         B         D         C         X
2013-01-01 -0.239981 -0.720872 -0.384446  2.096242 -0.635704
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910

In [93]:
df["2013-01-05":"2013-01-06"]

                   A         B         D         C         X
2013-01-05 -0.561865 -0.912876  0.252763  0.271427  1.259736
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716

# Selección por etiqueta

Sección cruzada por medio de una etiqueta.

In [95]:
df.loc[dates[0]]

A   -0.239981
B   -0.720872
D   -0.384446
C    2.096242
X   -0.635704
Name: 2013-01-01 00:00:00, dtype: float64

Seleccionando múltiples ejes por una etiqueta.

In [97]:
df.loc[:,["D","X"]]

                   D         X
2013-01-01 -0.384446 -0.635704
2013-01-02 -1.597805  1.435910
2013-01-03  0.976192  0.730197
2013-01-04  1.540251  1.101655
2013-01-05  0.252763  1.259736
2013-01-06 -0.337386  0.466716

Slicing de etiqueta, se incluyen ambos endpoints.

In [98]:
df.loc["2013-01-02":"2013-01-03", ["X", "C","D"]]

                   X         C         D
2013-01-02  1.435910  1.267222 -1.597805
2013-01-03  0.730197  0.104818  0.976192

Reducción a una dimensión.

Valor escalar.

In [99]:
df.loc["20130103", "C"]

0.10481806501737151

Más eficiente en desempeño.

In [100]:
df.at[dates[2],"X"]

0.7301972163691961

## Selección por posición

Por medio de enteros.

In [101]:
df.iloc[1]

A   -0.427650
B   -1.771716
D   -1.597805
C    1.267222
X    1.435910
Name: 2013-01-02 00:00:00, dtype: float64

Por slices de enteros, similar a NumPy.

In [102]:
df.iloc[3:5, 2:]

                   D         C         X
2013-01-04  1.540251 -0.969621  1.101655
2013-01-05  0.252763  0.271427  1.259736

Por listas de enteros.

In [103]:
df.iloc[[1,3,4],[2,0]]

                   D         A
2013-01-02 -1.597805 -0.427650
2013-01-04  1.540251 -0.308344
2013-01-05  0.252763 -0.561865

Slicing de renglones explícitos.

In [104]:
df.iloc[0:3,:]

                   A         B         D         C         X
2013-01-01 -0.239981 -0.720872 -0.384446  2.096242 -0.635704
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197

Slicing de columnas explícitas.

In [105]:
df.iloc[:,0:3]

                   A         B         D
2013-01-01 -0.239981 -0.720872 -0.384446
2013-01-02 -0.427650 -1.771716 -1.597805
2013-01-03  0.037337  0.787359  0.976192
2013-01-04 -0.308344  2.326122  1.540251
2013-01-05 -0.561865 -0.912876  0.252763
2013-01-06  0.027706  0.110130 -0.337386

Para obtener un valor explícito.

In [147]:
df.iloc[1,1]

-1.3246558626059466

Mejor desempeño con `iat`.

In [148]:
df.iat[0,0]

-1.3760867365349525

# Índices booleanos

Selección de datos por una columna.

In [108]:
df[df["A"]>0]

                   A         B         D         C         X
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716

Selección de datos por una condición.

In [109]:
df[df<0]

                   A         B         D         C         X
2013-01-01 -0.239981 -0.720872 -0.384446       NaN -0.635704
2013-01-02 -0.427650 -1.771716 -1.597805       NaN       NaN
2013-01-03       NaN       NaN       NaN       NaN       NaN
2013-01-04 -0.308344       NaN       NaN -0.969621       NaN
2013-01-05 -0.561865 -0.912876       NaN       NaN       NaN
2013-01-06       NaN       NaN -0.337386       NaN       NaN

Empleando dos columnas para seleccionar datos

In [110]:
df[(df["A"]>0) & (df["D"]<0)]

                   A        B         D        C         X
2013-01-06  0.027706  0.11013 -0.337386  1.03767  0.466716

Empleando `isin()` para filtrado.

In [111]:
df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         D         C         X      E
2013-01-01 -0.239981 -0.720872 -0.384446  2.096242 -0.635704    one
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910    one
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197    two
2013-01-04 -0.308344  2.326122  1.540251 -0.969621  1.101655  three
2013-01-05 -0.561865 -0.912876  0.252763  0.271427  1.259736   four
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716  three

In [112]:
df2[df2["E"].isin(["one", "three"])]

                   A         B         D         C         X      E
2013-01-01 -0.239981 -0.720872 -0.384446  2.096242 -0.635704    one
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910    one
2013-01-04 -0.308344  2.326122  1.540251 -0.969621  1.101655  three
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716  three

# Asignación de valores

Al añadir una columna, los datos se alinean automáticamente por el índice.

In [113]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods=6))
s1
df["F"] = s1

Asignar valores por etiquetas.

In [114]:
df.at[dates[0], "B"] = 0

Asignar valores por posición.

In [115]:
df.iat[0,1] = 0
df

                   A         B         D         C         X    F
2013-01-01 -0.239981  0.000000 -0.384446  2.096242 -0.635704  NaN
2013-01-02 -0.427650 -1.771716 -1.597805  1.267222  1.435910  1.0
2013-01-03  0.037337  0.787359  0.976192  0.104818  0.730197  2.0
2013-01-04 -0.308344  2.326122  1.540251 -0.969621  1.101655  3.0
2013-01-05 -0.561865 -0.912876  0.252763  0.271427  1.259736  4.0
2013-01-06  0.027706  0.110130 -0.337386  1.037670  0.466716  5.0

In [151]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B  D         C         X
2013-01-01 -1.376087  0.502918  5 -0.311570 -1.737691
2013-01-02  0.085106 -1.324656  5  0.341693  1.377019
2013-01-03 -0.452804 -0.944107  5  0.377383  1.557824
2013-01-04 -0.586525  0.224899  5  0.989342  0.447174
2013-01-05  1.574519 -0.838972  5 -0.232958  0.096228
2013-01-06  1.026690  1.149348  5 -0.925314  1.164208

Operación `where` con valor.

In [118]:
df2 = df.copy()
df2[df2>0] = -df2
df2

                   A         B  D         C         X    F
2013-01-01 -0.239981  0.000000 -5 -2.096242 -0.635704  NaN
2013-01-02 -0.427650 -1.771716 -5 -1.267222 -1.435910 -1.0
2013-01-03 -0.037337 -0.787359 -5 -0.104818 -0.730197 -2.0
2013-01-04 -0.308344 -2.326122 -5 -0.969621 -1.101655 -3.0
2013-01-05 -0.561865 -0.912876 -5 -0.271427 -1.259736 -4.0
2013-01-06 -0.027706 -0.110130 -5 -1.037670 -0.466716 -5.0

# Datos faltantes

Pandas usa `np.nan` para representar datos faltantes. No se incluyen en cálculos.

`reindex` permite modificar el índice en un eje especificado. Regresa una copia de los datos.

In [119]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B  D         C         X    F    E
2013-01-01 -0.239981  0.000000  5  2.096242 -0.635704  NaN  1.0
2013-01-02 -0.427650 -1.771716  5  1.267222  1.435910  1.0  1.0
2013-01-03  0.037337  0.787359  5  0.104818  0.730197  2.0  NaN
2013-01-04 -0.308344  2.326122  5 -0.969621  1.101655  3.0  NaN

Eliminar renglones con datos faltantes.

In [120]:
df1.dropna(how="any")

                  A         B  D         C        X    F    E
2013-01-02 -0.42765 -1.771716  5  1.267222  1.43591  1.0  1.0

Completar datos faltantes.

In [121]:
df1.fillna(value=5)

                   A         B  D         C         X    F    E
2013-01-01 -0.239981  0.000000  5  2.096242 -0.635704  5.0  1.0
2013-01-02 -0.427650 -1.771716  5  1.267222  1.435910  1.0  1.0
2013-01-03  0.037337  0.787359  5  0.104818  0.730197  2.0  5.0
2013-01-04 -0.308344  2.326122  5 -0.969621  1.101655  3.0  5.0

Obtener una máscara booleana para valores `nan`.

In [122]:
pd.isna(df1)

                A      B      D      C      X      F      E
2013-01-01  False  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False  False
2013-01-03  False  False  False  False  False  False   True
2013-01-04  False  False  False  False  False  False   True

# Operaciones
En general excluyen datos faltantes.

In [123]:
df.mean()

A   -0.245466
B    0.089836
D    5.000000
C    0.634626
X    0.726418
F    3.000000
dtype: float64

Sobre el otro eje.

In [124]:
df.mean(1)

2013-01-01    1.244111
2013-01-02    1.083961
2013-01-03    1.443285
2013-01-04    1.691635
2013-01-05    1.509404
2013-01-06    1.940370
Freq: D, dtype: float64

Pandas automáticamente efectúa broadcasting en la dimensión especificada cuando los objetos tienen distintas dimensiones.

In [125]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [126]:
df.sub(s, axis="index")

                   A         B    D         C         X    F
2013-01-01       NaN       NaN  NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN  NaN       NaN       NaN  NaN
2013-01-03 -0.962663 -0.212641  4.0 -0.895182 -0.269803  1.0
2013-01-04 -3.308344 -0.673878  2.0 -3.969621 -1.898345  0.0
2013-01-05 -5.561865 -5.912876  0.0 -4.728573 -3.740264 -1.0
2013-01-06       NaN       NaN  NaN       NaN       NaN  NaN

# Apply

Aplicar funciones a los datos.

In [127]:
df.apply(np.cumsum)

                   A         B   D         C         X     F
2013-01-01 -0.239981  0.000000   5  2.096242 -0.635704   NaN
2013-01-02 -0.667631 -1.771716  10  3.363464  0.800205   1.0
2013-01-03 -0.630294 -0.984357  15  3.468282  1.530403   3.0
2013-01-04 -0.938638  1.341764  20  2.498660  2.632058   6.0
2013-01-05 -1.500502  0.428888  25  2.770087  3.891795  10.0
2013-01-06 -1.472796  0.539018  30  3.807757  4.358511  15.0

In [153]:
df.apply(lambda x: x.max() - x.min())

A    2.950605
B    2.474004
D    0.000000
C    1.914655
X    3.295514
dtype: float64

# Histogramas

In [129]:
s = pd.Series(np.random.randint(0,7, size=10))
s.value_counts()

2    4
6    3
3    2
0    1
dtype: int64

# Métodos de strings

In [130]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge

## Concat

pandas provee varias facilidades para combinar objetos Series y DataFrame con varios tipos de lógica de conjunto para los índices y funcionalidad de álgebra relacional en caso de operaciones join/merge.

Concatenando objetos pandas.

In [131]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  0.543649 -0.527289 -0.012032  1.871736
1  0.326043  0.566048 -0.375631 -0.368199
2  0.873311 -1.536649 -0.746624 -0.364895
3 -0.043251 -2.575166  0.482898  0.006813
4  0.546561 -0.112508 -1.108838  0.321365
5  0.946485  0.594501  1.285085  0.308013
6 -0.298590 -0.101521 -1.054930  0.442825
7  0.423533 -0.111391 -1.124804 -1.134639
8  1.066338  1.017286  1.862915 -2.255969
9  0.678714  1.619631  1.182471  0.045275

In [132]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.543649 -0.527289 -0.012032  1.871736
 1  0.326043  0.566048 -0.375631 -0.368199
 2  0.873311 -1.536649 -0.746624 -0.364895,
           0         1         2         3
 3 -0.043251 -2.575166  0.482898  0.006813
 4  0.546561 -0.112508 -1.108838  0.321365
 5  0.946485  0.594501  1.285085  0.308013
 6 -0.298590 -0.101521 -1.054930  0.442825,
           0         1         2         3
 7  0.423533 -0.111391 -1.124804 -1.134639
 8  1.066338  1.017286  1.862915 -2.255969
 9  0.678714  1.619631  1.182471  0.045275]

In [133]:
pd.concat(pieces)

          0         1         2         3
0  0.543649 -0.527289 -0.012032  1.871736
1  0.326043  0.566048 -0.375631 -0.368199
2  0.873311 -1.536649 -0.746624 -0.364895
3 -0.043251 -2.575166  0.482898  0.006813
4  0.546561 -0.112508 -1.108838  0.321365
5  0.946485  0.594501  1.285085  0.308013
6 -0.298590 -0.101521 -1.054930  0.442825
7  0.423533 -0.111391 -1.124804 -1.134639
8  1.066338  1.017286  1.862915 -2.255969
9  0.678714  1.619631  1.182471  0.045275

# Join

Combinaciones estilo SQL.

In [134]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Otro ejemplo.

In [135]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1,2]})
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Agrupación

En pandas "group by" se refiere procesos que involucren uno o más de los siguientes pasos:
* Dividir los datos en grupos.
* Aplicar una función a cada grupo de forma independiente.
* Combinar los resultados en una estructura de datos.

In [136]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),  
    }
)
df

     A      B         C         D
0  foo    one -0.141849  0.025827
1  bar    one -0.279420 -0.612063
2  foo    two  1.538383  0.392080
3  bar  three  0.924606  0.450539
4  foo    two  1.512322 -0.038294
5  bar    two  1.431085  0.873419
6  foo    one -0.415685  0.821369
7  foo  three -0.460895 -0.363923

Agrupación con `sum()`.

In [137]:
df.groupby("A").sum()

            C         D
A
bar  2.076270  0.711895
foo  2.032275  0.837059

Al agrupar por múltiples columnas se forma un índice jerárquico.

In [138]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.279420 -0.612063
    three  0.924606  0.450539
    two    1.431085  0.873419
foo one   -0.557534  0.847196
    three -0.460895 -0.363923
    two    3.050705  0.353786

# Reshaping

## Stack

In [139]:
tuples = list(
    zip(
        *[
            ["bar", "bar", "baz", "baz", "foo", "foo", "cux", "cux"],
            ["one", "two", "one", "two", "one", "two", "one", "two"]
        ]
    )
)
index = pd.MultiIndex.from_tuples(tuples, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=["A", "B"])
df
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.334219  0.258781
      two     1.187737  0.749323
baz   one     0.418368 -0.690407
      two     0.553229 -0.251403

El método `stack()` comprime un nivel en las columnas del DataFrame.

In [140]:
stacked = df2.stack()
stacked

first  second
bar    one     A   -0.334219
               B    0.258781
       two     A    1.187737
               B    0.749323
baz    one     A    0.418368
               B   -0.690407
       two     A    0.553229
               B   -0.251403
dtype: float64

`unstack()` efectúa la operación inversa en el último nivel por omisión.

In [141]:
stacked.unstack()

                     A         B
first second
bar   one    -0.334219  0.258781
      two     1.187737  0.749323
baz   one     0.418368 -0.690407
      two     0.553229 -0.251403

# Tablas pivote

In [142]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12)
    }
)
df

        A  B    C         D         E
0     one  A  foo  0.113579  2.252147
1     one  B  foo  0.397724  0.344243
2     two  C  foo  1.422486  1.256711
3   three  A  bar -0.654050 -0.049415
4     one  B  bar -0.616060  0.187140
5     one  C  bar -0.127900 -1.642110
6     two  A  foo -1.650600  1.025318
7   three  B  foo -0.009716  1.359161
8     one  C  foo  0.975968 -0.423061
9     one  A  bar -0.633864 -1.616546
10    two  B  bar -1.681283 -0.845492
11  three  C  bar  0.555504 -1.007658

In [143]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A -0.633864  0.113579
      B -0.616060  0.397724
      C -0.127900  0.975968
three A -0.654050       NaN
      B       NaN -0.009716
      C  0.555504       NaN
two   A       NaN -1.650600
      B -1.681283       NaN
      C       NaN  1.422486